package backend.academy.hangman.output;

/**
 * Класс, содержащий все стадии виселицы и выводящий виселицу в зависимости от количества ошибок пользователя
 */
public class VisualizerHangman {
    private final String[] stages = {
        "",
        """












                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │     │
                         │            ─┐─
                         │
                         │
                         │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │     │
                         │            ─┐─
                         │             │
                         │             │
                         │             │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │     │
                         │            ─┐─
                         │            ╱│
                         │           / │
                         │             │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │     │
                         │            ─┐─
                         │            ╱│╲
                         │           / │ \\
                         │             │
                         │
                         │
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │     │
                         │            ─┐─
                         │            ╱│╲
                         │           / │ \\
                         │             │
                         │            /
                         │           /
                         │
                     ‾‾‾‾‾‾‾‾‾
            """,
        """

                         ├─────────────┐
                         │             │
                         │            ───
                         │          │ ✖ ✖│ черешня)
                         │            ─┐─
                         │            ╱│╲
                         │           / │ \\
                         │             │
                         │            / \\
                         │           /   \\
                         │
                     ‾‾‾‾‾‾‾‾‾
            """
    };

    /**
     * Метод, выводящий через класс {@link Interface} стадию виселицы в зависимости от количества ошибок пользователя
     * @param mistake количество ошибок пользователя
     */
    public void print(int mistake) {
        Interface.print(stages[mistake], false);
    }
}
